2016/brp 2016-02-09/art/art-data/resources/resources/RequestTemplates/KUC033-MededelingVerzoek_request_template-033.xml

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">
   <soapenv:Header>${DataSource Values#Header_EEE1}</soapenv:Header>
   <soapenv:Body>
      <brp:bhg_dvmRegistreerMededelingVerzoek xmlns:brp="http://www.bzk.nl/brp/brp0200">
         <brp:stuurgegevens brp:communicatieID="comid.stuurgegevens00B">
            <brp:zendendePartij>${DataSource Values#zendendePartij_zsD1}</brp:zendendePartij>
            <brp:zendendeSysteem>${DataSource Values#zendendeSysteem_zsD1}</brp:zendendeSysteem>
            <brp:referentienummer>${DataSource Values#referentienummer_sDB1}</brp:referentienummer>
            <brp:tijdstipVerzending>[moment_volgen]</brp:tijdstipVerzending>
         </brp:stuurgegevens>
         <brp:parameters brp:communicatieID="${DataSource Values#com_id.parameters1}">
            <brp:verwerkingswijze>${DataSource Values#verwerkingswijze_pDB1}</brp:verwerkingswijze>
         </brp:parameters>
         <brp:wijzigingVerstrekkingsbeperking
                                                brp:communicatieID="${DataSource Values#comid.wijzVerstrekkingsbeperking1}"
                                                brp:objecttype="AdministratieveHandeling">
            <brp:partijCode>${DataSource Values#partijCode_rDB1}</brp:partijCode>
            <brp:toelichtingOntlening>${DataSource Values#toelichtingOntlening_rDB1}</brp:toelichtingOntlening>
            <brp:gedeblokkeerdeMeldingen>
               <brp:gedeblokkeerdeMelding brp:communicatieID="${DataSource Values#com_id.gedeblokkeerdeMelding1}"
                                          brp:referentieID="${DataSource Values#ref_id.gedeblokkeerdeMelding1}"
                                          brp:objecttype="GedeblokkeerdeMelding">
                  <brp:regelCode>${DataSource Values#regelCode_ggr1}</brp:regelCode>
                  <brp:elementNaam>${DataSource Values#elementNaam_ggr1}</brp:elementNaam>
               </brp:gedeblokkeerdeMelding>
            </brp:gedeblokkeerdeMeldingen>
            <brp:bronnen>
				<brp:bron brp:objecttype="ActieBron" brp:communicatieID="${DataSource Values#comid.bron1}">
				   <brp:document brp:communicatieID="Document1"
								 brp:objecttype="Document">
					  <brp:soortNaam>${DataSource Values#soortNaam_dbr1}</brp:soortNaam>
					  <brp:identificatie>${DataSource Values#identificatie_dbr1}</brp:identificatie>
					  <brp:aktenummer>${DataSource Values#aktenummer_dbr1}</brp:aktenummer>
					  <brp:partijCode>${DataSource Values#partijCode_dbr1}</brp:partijCode>
				   </brp:document>
				</brp:bron>
            </brp:bronnen>
            <brp:acties>
               <brp:registratieVerstrekkingsbeperking brp:communicatieID="${DataSource Values#comid.registrVerstrekkingsbeperking1}"
                                                      brp:objecttype="Actie">
                  <brp:datumAanvangGeldigheid>${DataSource Values#datumAanvangGeldigheid_rar1}</brp:datumAanvangGeldigheid>
                  <brp:datumEindeGeldigheid>${DataSource Values#datumEindeGeldigheid_rar1}</brp:datumEindeGeldigheid>
                  <brp:bronnen>
							<brp:bron brp:communicatieID="BronDocument1"
                                   brp:referentieID="${DataSource Values#refid.brondocument1}"
                                   brp:objecttype="ActieBron">
							</brp:bron>
                  </brp:bronnen>
                  <brp:persoon brp:communicatieID="${DataSource Values#com_id.persoon1}"
                               brp:objecttype="Persoon"
                               brp:objectSleutel="${DataSource Values#objectid.persoon1}">
                     <brp:indicaties>
                        <brp:volledigeVerstrekkingsbeperking brp:communicatieID="${DataSource Values#com_id.verstrekkingsbeperking1}"
                                                    brp:objecttype="PersoonIndicatie">
                           <brp:waarde>${DataSource Values#waarde_vip1}</brp:waarde>
                        </brp:volledigeVerstrekkingsbeperking>
                     </brp:indicaties>
					 <brp:verstrekkingsbeperkingen>
                        <brp:verstrekkingsbeperking brp:objecttype="PersoonVerstrekkingsbeperking" brp:communicatieID="${DataSource Values#comid.specverstrekkingbeperking1}">
                           <brp:partijCode>${DataSource Values#partijCode_specifiek1}</brp:partijCode>
                           <brp:omschrijvingDerde>${DataSource Values#omschrijvingDerde1}</brp:omschrijvingDerde>
                           <brp:gemeenteVerordeningPartijCode>${DataSource Values#gemeenteverordening_partijCode1}</brp:gemeenteVerordeningPartijCode>
                        </brp:verstrekkingsbeperking>
                     </brp:verstrekkingsbeperkingen>
                  </brp:persoon>
               </brp:registratieVerstrekkingsbeperking>
            </brp:acties>
         </brp:wijzigingVerstrekkingsbeperking>
         <brp:wijzigingGezag
                                       brp:communicatieID="${DataSource Values#com_id.wijzigingGezag1}"
                                       brp:objecttype="AdministratieveHandeling">
            <brp:partijCode>${DataSource Values#partijCode_mDB1}</brp:partijCode>
            <brp:toelichtingOntlening>${DataSource Values#toelichtingOntlening_mDB1}</brp:toelichtingOntlening>
            <brp:gedeblokkeerdeMeldingen>
               <brp:gedeblokkeerdeMelding brp:communicatieID="${DataSource Values#com_id.gedeblokkeerdeMelding2}"
                                          brp:referentieID="${DataSource Values#ref_id.gedeblokkeerdeMelding2}"
                                          brp:objecttype="GedeblokkeerdeMelding">
                  <brp:regelCode>${DataSource Values#regelCode_ggm1}</brp:regelCode>
                  <brp:elementNaam>${DataSource Values#elementNaam_ggm1}</brp:elementNaam>
               </brp:gedeblokkeerdeMelding>
			   <brp:gedeblokkeerdeMelding brp:communicatieID="${DataSource Values#com_id.gedeblokkeerdeMelding21}"
                                          brp:referentieID="${DataSource Values#ref_id.gedeblokkeerdeMelding21}"
                                          brp:objecttype="GedeblokkeerdeMelding">
                  <brp:regelCode>${DataSource Values#regelCode_ggm21}</brp:regelCode>
                  <brp:elementNaam>${DataSource Values#elementNaam_ggm21}</brp:elementNaam>
               </brp:gedeblokkeerdeMelding>
            </brp:gedeblokkeerdeMeldingen>
            <brp:bronnen>
				<brp:bron brp:objecttype="ActieBron" brp:communicatieID="${DataSource Values#comid.bron2}">
				   <brp:document brp:communicatieID="Document2"
								 brp:objecttype="Document">
					  <brp:soortNaam>${DataSource Values#soortNaam_dbm1}</brp:soortNaam>
					  <brp:identificatie>${DataSource Values#identificatie_dbm1}</brp:identificatie>
					  <brp:aktenummer>${DataSource Values#aktenummer_dbm1}</brp:aktenummer>
					  <brp:partijCode>${DataSource Values#partijCode_dbm1}</brp:partijCode>
				   </brp:document>
				</brp:bron>
            </brp:bronnen>
            <brp:acties>
               <brp:registratieGezag brp:communicatieID="${DataSource Values#com_id.registratieGezag1}"
                                     brp:objecttype="Actie">
                  <brp:datumAanvangGeldigheid>${DataSource Values#datumAanvangGeldigheid_ram1}</brp:datumAanvangGeldigheid>
                  <brp:datumEindeGeldigheid>${DataSource Values#datumEindeGeldigheid_ram1}</brp:datumEindeGeldigheid>
                  <brp:bronnen>
							<brp:bron brp:communicatieID="BronDocument2"
                                   brp:referentieID="${DataSource Values#refid.brondocument2}"
                                   brp:objecttype="ActieBron">
							</brp:bron>
                  </brp:bronnen>
                  <brp:persoon brp:communicatieID="${DataSource Values#com_id.persoon2}"
                               brp:objecttype="Persoon"
                               brp:objectSleutel="${DataSource Values#objectid.persoon2}">
                     <brp:indicaties>
                        <brp:derdeHeeftGezag brp:communicatieID="${DataSource Values#com_id.derdeHeeftGezag1}"
                                             brp:objecttype="PersoonIndicatie">
                           <brp:waarde>${DataSource Values#waarde_dip1}</brp:waarde>
                        </brp:derdeHeeftGezag>
                     </brp:indicaties>
                     <brp:betrokkenheden>
                        <brp:kind brp:communicatieID="${DataSource Values#com_id.kind1}"
                                  brp:objecttype="Betrokkenheid"
                                  brp:objectSleutel="${DataSource Values#objectid.kind1}">
                           <brp:familierechtelijkeBetrekking brp:communicatieID="${DataSource Values#com_id.familierechtelijkeBetrekking1}"
                                                             brp:objecttype="Relatie"
                                                             brp:objectSleutel="${DataSource Values#objectid.familierechtelijkeBetrekking1}">
                              <brp:betrokkenheden>
                                 <brp:ouder brp:communicatieID="${DataSource Values#com_id.ouder1}"
                                            brp:objecttype="Betrokkenheid"
                                            brp:objectSleutel="${DataSource Values#objectid.ouder1}">
                                    <brp:persoon brp:communicatieID="${DataSource Values#com_id.persoon3}"
                                                 brp:objecttype="Persoon"
                                                 brp:objectSleutel="${DataSource Values#objectid.persoon3}">${DataSource Values#persoon_obf1}</brp:persoon>
                                    <brp:ouderlijkGezag brp:communicatieID="${DataSource Values#com_id.ouderlijkGezag1}">
                                       <brp:indicatieOuderHeeftGezag>${DataSource Values#indicatieOuderHeeftGezag_oob1}</brp:indicatieOuderHeeftGezag>
                                    </brp:ouderlijkGezag>
                                 </brp:ouder>
                                 <brp:ouder brp:communicatieID="${DataSource Values#com_id.ouder2}"
                                            brp:objecttype="Betrokkenheid"
                                            brp:objectSleutel="${DataSource Values#objectid.ouder2}">
                                    <brp:persoon brp:communicatieID="${DataSource Values#com_id.persoon4}"
                                                 brp:objecttype="Persoon"
                                                 brp:objectSleutel="${DataSource Values#objectid.persoon4}">${DataSource Values#persoon_obf2}</brp:persoon>
                                    <brp:ouderlijkGezag brp:communicatieID="${DataSource Values#com_id.ouderlijkGezag2}">
                                       <brp:indicatieOuderHeeftGezag>${DataSource Values#indicatieOuderHeeftGezag_oob2}</brp:indicatieOuderHeeftGezag>
                                    </brp:ouderlijkGezag>
                                 </brp:ouder>
                              </brp:betrokkenheden>
                           </brp:familierechtelijkeBetrekking>
                        </brp:kind>
                     </brp:betrokkenheden>
                  </brp:persoon>
               </brp:registratieGezag>
            </brp:acties>
         </brp:wijzigingGezag>
         <brp:wijzigingCuratele
                                         brp:communicatieID="${DataSource Values#com_id.wijzigingCuratele1}"
                                         brp:objecttype="AdministratieveHandeling">
            <brp:partijCode>${DataSource Values#partijCode_mDB2}</brp:partijCode>
            <brp:toelichtingOntlening>${DataSource Values#toelichtingOntlening_mDB2}</brp:toelichtingOntlening>
            <brp:gedeblokkeerdeMeldingen>
               <brp:gedeblokkeerdeMelding brp:communicatieID="${DataSource Values#com_id.gedeblokkeerdeMelding3}"
                                          brp:referentieID="${DataSource Values#ref_id.gedeblokkeerdeMelding3}"
                                          brp:objecttype="GedeblokkeerdeMelding">
                  <brp:regelCode>${DataSource Values#regelCode_ggm2}</brp:regelCode>
                  <brp:elementNaam>${DataSource Values#elementNaam_ggm2}</brp:elementNaam>
               </brp:gedeblokkeerdeMelding>
            </brp:gedeblokkeerdeMeldingen>
            <brp:bronnen>
				<brp:bron brp:objecttype="ActieBron" brp:communicatieID="${DataSource Values#comid.bron3}">
				   <brp:document brp:communicatieID="Document3"
								 brp:objecttype="Document">
					  <brp:soortNaam>${DataSource Values#soortNaam_dbm2}</brp:soortNaam>
					  <brp:identificatie>${DataSource Values#identificatie_dbm2}</brp:identificatie>
					  <brp:aktenummer>${DataSource Values#aktenummer_dbm2}</brp:aktenummer>
					  <brp:partijCode>${DataSource Values#partijCode_dbm2}</brp:partijCode>
				   </brp:document>
				</brp:bron>
            </brp:bronnen>
            <brp:acties>
               <brp:registratieCuratele brp:communicatieID="${DataSource Values#comid.registratieCuratele1}"
                                        brp:objecttype="Actie">
                  <brp:datumAanvangGeldigheid>${DataSource Values#datumAanvangGeldigheid_ram2}</brp:datumAanvangGeldigheid>
                  <brp:datumEindeGeldigheid>${DataSource Values#datumEindeGeldigheid_ram2}</brp:datumEindeGeldigheid>
                  <brp:bronnen>
							<brp:bron brp:communicatieID="BronDocument3"
                                   brp:referentieID="${DataSource Values#refid.brondocument3}"
                                   brp:objecttype="ActieBron">
							</brp:bron>
                  </brp:bronnen>
                  <brp:persoon brp:communicatieID="${DataSource Values#com_id.persoon5}"
                               brp:objecttype="Persoon"
                               brp:objectSleutel="${DataSource Values#objectid.persoon5}">
                     <brp:indicaties>
                        <brp:onderCuratele brp:communicatieID="${DataSource Values#com_id.onderCuratele1}"
                                           brp:objecttype="PersoonIndicatie">
                           <brp:waarde>${DataSource Values#waarde_oip1}</brp:waarde>
                        </brp:onderCuratele>
                     </brp:indicaties>
                  </brp:persoon>
               </brp:registratieCuratele>
            </brp:acties>
         </brp:wijzigingCuratele>
      </brp:bhg_dvmRegistreerMededelingVerzoek>
   </soapenv:Body>
</soapenv:Envelope>
